/**
  * Created by rzx on 2016/9/19.
  */
object MessageTest {
  def main(args: Array[String]): Unit = {
    val s = "CNCERT<--->917MT<--->404004<--->恶意代码<--->木马<--->远程控制木马<--->木马-远控-白金远控-基础2<--->2016-05-16 23:57:35<--->20160516<--->23<--->195.67.0.58<--->3275948090<--->54229<--->219.139.115.215<--->3683349463<--->8086<--->1<--->r=cb1st\\16\\00\\00\\00\\01\\00\\00\\00x\\9C3\\04\\00\\002\\002<--->境外<--->瑞典<---><--->境内<--->湖北<--->电信<--->18.1<--->59.3<--->114.3<--->30.6<--->GJ<--->GZDXTOHE<--->DX<---><---><--->N/A"
    val dnsString = "180.76.76.76\t172.20.21.82\tqbwup.imtt.qq.com\t1\t1\t1\t1\t0\t1\t61.151.218.13\t272\t2016-09-07 11:01:41.952334\tBJ\t电信\t1"
    val ss = s.split("<--->")
    //    println(ss(10))
    //    println(ss.length)
    println(s"${"zzz"}   ${"bbb"}")
    val name = "zyc"
    println(s"$name")
  }
}
